Documents/УЧ_ВзаимозачетыПредприятий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>УЧ_ВзаимозачетыПредприятий</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Учетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокОснование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Учетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасшифровкаОплаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПлатежноеПоручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДохода</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Учетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорСубконто1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорСубконто2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорСубконто3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расшифровка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Редактор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВнутреннийДоговор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВнутренниеДоговоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВнутренниеДоговоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВнутренниеДоговоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетЗатрат</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Учетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КорСубконто1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КорСубконто2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КорСубконто3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccountingRegisters/Учетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<AccountingRegister>
		<Properties>
			<Name>Учетный</Name>
			<ChartOfAccounts>ChartOfAccounts.Учетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Предприятия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СценарийПлана</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Учетный.AccountingFlag.УчетПоПодразделениям</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Учетный.AccountingFlag.Количественный</AccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоКРХ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Учетный.AccountingFlag.Крахмал</AccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Учетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиДок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

ChartsOfAccounts/Учетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<ChartOfAccounts>
		<Properties>
			<Name>Учетный</Name>
			<ExtDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</ExtDimensionTypes>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗапретитьИспользоватьВПроводках</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОтражаетсяВБалансе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодБыстрогоВыбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДенежныйСчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаНоменклатуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<AccountingFlag>
				<Properties>
					<Name>Количественный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>Крахмал</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>Валютный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>УчетПоПодразделениям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
		</ChildObjects>
	</ChartOfAccounts>
</MetaDataObject>

Documents/УЧ_ВзаимозачетыПредприятий/Ext/ObjectModule.bsl
Процедура НоваяСтрокаРегистраБух(
	Движения,
	Дата,
	Предприятие,
	Сценарий,
	Содержание,
	СчетДт,
	СубконтоДт1,
	СубконтоДт2,
	СубконтоДт3,
	ПодразделениеДт,
	КоличествоДт,
	ВалютаДт,
	ВалСуммаДт,
	СчетКт,
	СубконтоКт1,
	СубконтоКт2,
	СубконтоКт3,
	ПодразделениеКт,
	КоличествоКт,
	ВалютаКт,
	ВалСуммаКт,
	Сумма,
	Приход,
	ФинЦФО = Неопределено,
	ФинПодразделениеЦФО = Неопределено)	
	
	Условие_79_55 = (СчетДт = ПланыСчетов.Учетный.Счет5501() И СчетКт.Родитель = ПланыСчетов.Учетный.Счет79()) ИЛИ (СчетКт = ПланыСчетов.Учетный.Счет5501() И СчетДт.Родитель = ПланыСчетов.Учетный.Счет79());
	
	Движение = Движения.Учетный.Добавить();
	Движение.Период = Дата;
	Движение.Предприятия = Предприятие;
	Движение.СценарийПлана = Сценарий;
	Движение.Содержание = Содержание;
	Если Приход Тогда
		Движение.СчетДт = СчетДт;
		УЧ_Сервер.УстановитьСубконто(Движение.СубконтоДт,СчетДт,1,СубконтоДт1);
		УЧ_Сервер.УстановитьСубконто(Движение.СубконтоДт,СчетДт,2,СубконтоДт2);
		УЧ_Сервер.УстановитьСубконто(Движение.СубконтоДт,СчетДт,3,СубконтоДт3);
		
		Если СчетДт.УчетПоПодразделениям Тогда
			Движение.ПодразделениеДт = ПодразделениеДт;	
		КонецЕсли;
		
		
		Если СчетДт.Количественный Тогда
			Движение.КоличествоДт = КоличествоДт;
		КонецЕсли;
		Если СчетДт.Валютный И (УЧ_Сервер.ДенежныйСчет(СчетДт) ИЛИ Предприятие.ВедетсяВалютныйУчет) Тогда
			Движение.ВалютаДт = ВалютаДт;	
			Движение.ВалютнаяСуммаДт = ВалСуммаДт;	
		КонецЕсли;
		
		//Если СчетДт.УчетПоЦФО Тогда
		//	Движение.ЦФО = Предприятие;
		//	Движение.ПодразделениеЦФО = ?(ЗначениеЗаполнено(ПодразделениеДт), ПодразделениеДт, ПодразделениеКт);
		//КонецЕсли;
		
		
		
		Движение.СчетКт = СчетКт;
		УЧ_Сервер.УстановитьСубконто(Движение.СубконтоКт,СчетКт,1,СубконтоКт1);
		УЧ_Сервер.УстановитьСубконто(Движение.СубконтоКт,СчетКт,2,СубконтоКт2);
		УЧ_Сервер.УстановитьСубконто(Движение.СубконтоКт,СчетКт,3,СубконтоКт3);
		
		Если СчетКт.УчетПоПодразделениям Тогда
			Движение.ПодразделениеКт = ПодразделениеКт;	
		КонецЕсли;
		Если СчетКт.Количественный Тогда
			Движение.КоличествоКт = КоличествоКт;
		КонецЕсли;
		Если СчетКт.Валютный И (УЧ_Сервер.ДенежныйСчет(СчетКт) ИЛИ Предприятие.ВедетсяВалютныйУчет) Тогда
			Движение.ВалютаКт = ВалютаКт;	
			Движение.ВалютнаяСуммаКт = ВалСуммаКт;	
		КонецЕсли;
		
		//Если СчетКт.УчетПоЦФО Тогда
		//	Движение.ЦФО = Предприятие;
		//	Движение.ПодразделениеЦФО = ?(ЗначениеЗаполнено(ПодразделениеДт), ПодразделениеДт, ПодразделениеКт);
		//КонецЕсли;
	Иначе
		
		Движение.СчетКт = СчетДт;
		УЧ_Сервер.УстановитьСубконто(Движение.СубконтоКт,СчетДт,1,СубконтоДт1);
		УЧ_Сервер.УстановитьСубконто(Движение.СубконтоКт,СчетДт,2,СубконтоДт2);
		УЧ_Сервер.УстановитьСубконто(Движение.СубконтоКт,СчетДт,3,СубконтоДт3);
		
		Если СчетДт.УчетПоПодразделениям Тогда
			Движение.ПодразделениеКт = ПодразделениеДт;	
		КонецЕсли;
		Если СчетДт.Количественный Тогда
			Движение.КоличествоКт = КоличествоДт;
		КонецЕсли;
		Если СчетДт.Валютный И (УЧ_Сервер.ДенежныйСчет(СчетДт) ИЛИ Предприятие.ВедетсяВалютныйУчет) Тогда
			Движение.ВалютаКт = ВалютаДт;	
			Движение.ВалютнаяСуммаКт = ВалСуммаДт;	
		КонецЕсли;
		
		//Если СчетДт.УчетПоЦФО Тогда
		//	Движение.ЦФО = Предприятие;
		//	Движение.ПодразделениеЦФО = ?(ЗначениеЗаполнено(ПодразделениеДт), ПодразделениеДт, ПодразделениеКт);
		//КонецЕсли;
		
		
		
		Движение.СчетДт = СчетКт;
		УЧ_Сервер.УстановитьСубконто(Движение.СубконтоДт,СчетКт,1,СубконтоКт1);
		УЧ_Сервер.УстановитьСубконто(Движение.СубконтоДт,СчетКт,2,СубконтоКт2);
		УЧ_Сервер.УстановитьСубконто(Движение.СубконтоДт,СчетКт,3,СубконтоКт3);
		
		Если СчетКт.УчетПоПодразделениям Тогда
			Движение.ПодразделениеДт = ПодразделениеКт;	
		КонецЕсли;
		Если СчетКт.Количественный Тогда
			Движение.КоличествоДт = КоличествоКт;
		КонецЕсли;
		Если СчетКт.Валютный  И (УЧ_Сервер.ДенежныйСчет(СчетКт) ИЛИ Предприятие.ВедетсяВалютныйУчет) Тогда
			Движение.ВалютаДт = ВалютаКт;	
			Движение.ВалютнаяСуммаДт = ВалСуммаКт;	
		КонецЕсли;				
		
		//Если СчетКт.УчетПоЦФО Тогда
		//	Движение.ЦФО = Предприятие;
		//	Движение.ПодразделениеЦФО = ?(ЗначениеЗаполнено(ПодразделениеДт), ПодразделениеДт, ПодразделениеКт);
		//КонецЕсли;
		
	КонецЕсли;	
	Движение.Сумма = Сумма;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.Учетный.Записывать = Истина;
	
	Транзит79 = Константы.сабУЧ_ИспользоватьПереводы.Получить();
	
	Для каждого ТекСтрока Из Состав Цикл
		
		Если Транзит79 Тогда
			//выручка проекта1
			НоваяСтрокаРегистраБух(
			Движения,
			Дата,
			Предприятие,
			Справочники.СценарииПланирования.НайтиПоНаименованию("Факт", Истина),
			?(ПустаяСтрока(Комментарий), ТекСтрока.Содержание, Комментарий + "
			|" + ТекСтрока.Содержание),
			Счет,
			ТекСтрока.Субконто1,
			ТекСтрока.Субконто2,
			ТекСтрока.Субконто3, 						//СубконтоДт3
			Подразделение, 									//ПодразделениеДт
			, 									//КоличествоДт
			, 							//ВалютаДт
			, 					//ВалСуммаДт
			СчетДохода,				//счетКт
			КорСубконто1,				//СубконтоКт1	
			КорСубконто2,				//СубконтоКт2 //добавил д1 16.06.16
			КорСубконто3,				//СубконтоКт3
			Подразделение,			//ПодразделениеКт
			,									//КоличествоДт
			,									//ВалютаКт
			,                                   //ВалСуммаКт
			ТекСтрока.Сумма,                     //Сумма
			Истина,
			,
			);			//СчетДт = СчетДт (приход)
			
			НоваяСтрокаРегистраБух(
			Движения,
			Дата, 								//дата 
			Предприятие, 							//предприятие
			Справочники.СценарииПланирования.НайтиПоНаименованию("Факт", Истина), 	//сценарий
			"(возм-е затрат) " + ?(ПустаяСтрока(Комментарий), ТекСтрока.Содержание, ?(ТекСтрока.Содержание = "", Комментарий, Комментарий + "
			|" + ТекСтрока.Содержание)),
			Счет, 							//счетДт
			ТекСтрока.Субконто1, 						//СубконтоДт1
			ТекСтрока.Субконто2, 						//СубконтоДт2
			ТекСтрока.Субконто3, 						//СубконтоДт3
			, 									//ПодразделениеДт
			, 									//КоличествоДт
			, 							//ВалютаДт
			, 					//ВалСуммаДт
			ПланыСчетов.Учетный.Счет5502(),						//счетКт
			ТекСтрока.Субконто1,				//СубконтоКт1	
			,				//СубконтоКт2 //добавил д1 16.06.16
			,				//СубконтоКт3
			,			//ПодразделениеКт
			,									//КоличествоДт
			,									//ВалютаКт
			,                                   //ВалСуммаКт
			ТекСтрока.Сумма,                     //Сумма
			Ложь,
			,
			);			//СчетДт = СчетДт (приход)
			
			НоваяСтрокаРегистраБух(
			Движения,
			Дата, 								//дата 
			ТекСтрока.Субконто1, 							//предприятие
			Справочники.СценарииПланирования.НайтиПоНаименованию("Факт", Истина), 	//сценарий
			"(возм-е затрат) " + ?(ПустаяСтрока(Комментарий), ТекСтрока.Содержание, ?(ТекСтрока.Содержание = "", Комментарий, Комментарий + "
			|" + ТекСтрока.Содержание)),
			Счет, 							//счетДт
			Предприятие, 						//СубконтоДт1
			ТекСтрока.ВнутреннийДоговор, 						//СубконтоДт2
			, 						//СубконтоДт3
			, 									//ПодразделениеДт
			, 									//КоличествоДт
			, 							//ВалютаДт
			, 					//ВалСуммаДт
			ПланыСчетов.Учетный.Счет5502(),						//счетКт
			Предприятие,				//СубконтоКт1	
			,				//СубконтоКт2 //добавил д1 16.06.16
			,				//СубконтоКт3
			,			//ПодразделениеКт
			,									//КоличествоДт
			,									//ВалютаКт
			,                                   //ВалСуммаКт
			ТекСтрока.Сумма,                     //Сумма
			Истина,
			,
			);			//СчетДт = СчетДт (приход)
			
			//затраты проекта2
			НоваяСтрокаРегистраБух(
			Движения,
			Дата,
			ТекСтрока.Субконто1,
			Справочники.СценарииПланирования.НайтиПоНаименованию("Факт", Истина),
			?(ПустаяСтрока(Комментарий), ТекСтрока.Содержание, Комментарий + "
			|" + ТекСтрока.Содержание),
			ТекСтрока.СчетЗатрат,
			ТекСтрока.КорСубконто1,
			ТекСтрока.КорСубконто2,
			ТекСтрока.КорСубконто3, 						//СубконтоДт3
			?(ТекСтрока.Субконто1.УчетПоПодразделениям, ТекСтрока.Подразделение, ТекСтрока.Субконто1.ВидДеятельности), 									//ПодразделениеДт
			ТекСтрока.Количество, 									//КоличествоДт
			, 							//ВалютаДт
			, 					//ВалСуммаДт
			Счет,				//счетКт
			Предприятие,				//СубконтоКт1	
			ТекСтрока.ВнутреннийДоговор,				//СубконтоКт2 //добавил д1 16.06.16
			,				//СубконтоКт3
			?(ТекСтрока.Субконто1.УчетПоПодразделениям, ТекСтрока.Подразделение, ТекСтрока.Субконто1.ВидДеятельности),			//ПодразделениеКт
			,									//КоличествоДт
			,									//ВалютаКт
			,                                   //ВалСуммаКт
			ТекСтрока.Сумма,                     //Сумма
			Истина,
			,
			);			//СчетДт = СчетДт (приход)
			
		Иначе
			//выручка проекта1
			НоваяСтрокаРегистраБух(
			Движения,
			Дата,
			Предприятие,
			Справочники.СценарииПланирования.НайтиПоНаименованию("Факт", Истина),
			?(ПустаяСтрока(Комментарий), ТекСтрока.Содержание, Комментарий + "
			|" + ТекСтрока.Содержание),
			ПланыСчетов.Учетный.Счет5502(),						//счетКт
			ТекСтрока.Субконто1,				//СубконтоКт1	
			,				//СубконтоКт2 //добавил д1 16.06.16
			,				//СубконтоКт3
			,			//ПодразделениеКт
			, 									//КоличествоДт
			, 							//ВалютаДт
			, 					//ВалСуммаДт
			СчетДохода,				//счетКт
			КорСубконто1,				//СубконтоКт1	
			КорСубконто2,				//СубконтоКт2 //добавил д1 16.06.16
			КорСубконто3,				//СубконтоКт3
			Подразделение,			//ПодразделениеКт
			,									//КоличествоДт
			,									//ВалютаКт
			,                                   //ВалСуммаКт
			ТекСтрока.Сумма,                     //Сумма
			Истина,
			,
			);			//СчетДт = СчетДт (приход)
			
			//затраты проекта2
			НоваяСтрокаРегистраБух(
			Движения,
			Дата,
			ТекСтрока.Субконто1,
			Справочники.СценарииПланирования.НайтиПоНаименованию("Факт", Истина),
			?(ПустаяСтрока(Комментарий), ТекСтрока.Содержание, Комментарий + "
			|" + ТекСтрока.Содержание),
			ТекСтрока.СчетЗатрат,
			ТекСтрока.КорСубконто1,
			ТекСтрока.КорСубконто2,
			ТекСтрока.КорСубконто3, 						//СубконтоДт3
			?(ТекСтрока.Субконто1.УчетПоПодразделениям, ТекСтрока.Подразделение, ТекСтрока.Субконто1.ВидДеятельности), 									//ПодразделениеДт
			ТекСтрока.Количество, 									//КоличествоДт
			, 							//ВалютаДт
			, 					//ВалСуммаДт
			ПланыСчетов.Учетный.Счет5502(),						//счетКт
			Предприятие,				//СубконтоКт1	
			,				//СубконтоКт2 //добавил д1 16.06.16
			,				//СубконтоКт3
			,			//ПодразделениеКт
			,									//КоличествоДт
			,									//ВалютаКт
			,                                   //ВалСуммаКт
			ТекСтрока.Сумма,                     //Сумма
			Истина,
			,
			);			//СчетДт = СчетДт (приход)
		КонецЕсли;
		
		
	КонецЦикла; 
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//из подписки на событие
	БюджетныйНаСервере.ДокументыПередЗаписьюПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	БюджетныйНаСервере.ПриУстановкеНовогоНомераПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	сабОбщегоНазначенияБУХ.сабОбработкиЗаполненияУчпетныхДокументовОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
КонецПроцедуры
